# SchemaBuilder Properties

---
The SchemaBuilder type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace